{
    "2022.aacl-tutorials.4": {
        "title": "Grounding Meaning Representation for Situated Reasoning",
        "author": "Nikhil Krishnaswamy, James Pustejovsky",
        "year": 2022,
        "url": "https://aclanthology.org/2022.aacl-tutorials.4",
        "doi": null,
        "abstract": "As natural language technology becomes ever-present in everyday life, people will expect artificial agents to understand language use as humans do. Nevertheless, most advanced neural AI systems fail at some types of interactions that are trivial for humans (e.g., ask a smart system “What am I pointing at?”). One critical aspect of human language understanding is situated reasoning, where inferences make reference to the local context, perceptual surroundings, and contextual groundings from the interaction. In this cutting-edge tutorial, we bring to the NLP/CL community a synthesis of multimodal grounding and meaning representation techniques with formal and computational models of embodied reasoning. We will discuss existing approaches to multimodal language grounding and meaning representations, discuss the kind of information each method captures and their relative suitability to situated reasoning tasks, and demon- strate how to construct agents that conduct situated reasoning by embodying a simulated environment. In doing so, these agents also represent their human interlocutor(s) within the simulation, and are represented through their virtual embodiment in the real world, enabling true bidirectional communication with a computer using multiple modalities.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    7771402,
                    5271395,
                    61979056,
                    263897619,
                    216951354,
                    205811696,
                    257985710,
                    240531414
                ]
            }
        ]
    }
}