{
    "2024.naacl-tutorials.2": {
        "title": "Combating Security and Privacy Issues in the Era of Large Language Models",
        "author": "Muhao Chen, Chaowei Xiao, Huan Sun, Lei Li, Leon Derczynski, Anima Anandkumar, Fei Wang",
        "year": 2024,
        "url": "https://aclanthology.org/2024.naacl-tutorials.2",
        "doi": null,
        "abstract": "This tutorial seeks to provide a systematic summary of risks and vulnerabilities in security, privacy and copyright aspects of large language models (LLMs), and most recent solutions to address those issues. We will discuss a broad thread of studies that try to answer the following questions: (i) How do we unravel the adversarial threats that attackers may leverage in the training time of LLMs, especially those that may exist in recent paradigms of instruction tuning and RLHF processes? (ii) How do we guard the LLMs against malicious attacks in inference time, such as attacks based on backdoors and jailbreaking? (iii) How do we ensure privacy protection of user information and LLM decisions for Language Model as-a-Service (LMaaS)? (iv) How do we protect the copyright of an LLM? (v) How do we detect and prevent cases where personal or confidential information is leaked during LLM training? (vi) How should we make policies to control against improper usage of LLM-generated content? In addition, will conclude the discussions by outlining emergent challenges in security, privacy and reliability of LLMs that deserve timely investigation by the community",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "3a1f8829e641b46f661775f64a7f27b933a46103",
                    "f5fa0b3c2ecbf17ba922932432bed46a1447ed23",
                    "82fe948f18ca0138d035f553286c5e4b712dbdbe",
                    "1abfc211793c683972ded8d3268475e3ee7a88b0",
                    "ff9d04fc15a2c52d982b5b7daa787a373ed7f899",
                    "58996964dbcd15045b66201c2b850b5570ba74cb",
                    "62d17b6f6ad77fd71ef9954c7784700d5e316f1f",
                    "cb5b71a622aff47014d4f28a958679629a8b6363",
                    "c25d2a27f1abe169d7b68078071b6698f0980469",
                    "49f1fa0d609ff06564b46270cbc022b7d9d195f4",
                    "cd0988714ea326642d2b1bb18753e187fec71e42"
                ]
            }
        ]
    }
}
