{
    "2023.emnlp-tutorial.6": {
        "title": "Creative Natural Language Generation",
        "author": "Tuhin Chakrabarty, Vishakh Padmakumar, He He, Nanyun Peng",
        "year": 2023,
        "url": "https://aclanthology.org/2023.emnlp-tutorial.6",
        "doi": "10.18653/v1/2023.emnlp-tutorial.6",
        "abstract": "Large language models such as GPT-3, GPT4, Claude etc., have advanced the state of the art in several natural language generation tasks such as text summarization and machine translation. However when it comes to open-ended tasks with a focus on creativity such as generating stories, poetry, or various forms of figurative language, these state-of-the-art language models are often found to be inadequate. This tutorial aims to bring awareness of the important and emerging research area of open-domain creative generation, with a focus on language generation while also touching on multi-modal generation (e.g., image captioning, visual metaphors). It targets natural language processing (NLP) and artificial intelligence (AI) researchers as well as creative writing practitioners who are interested in building systems that are capable of emulating as well as augmenting human creativity. In particular, we will review recent studies on creative language generation both at the sentence level as well as longer forms of text. We will provide the audiences with a holistic view of 1) the importance and challenges of building creative language generation systems; 2) how we incorporate content planning, domain knowledge and creativity specific heuristics for different forms of creative language generation such as story, poetry, humor, metaphors etc 3) how can we build better evaluation methods for creative text generation? In particular, how could the recent advancement of AI shape the future workforce for creativity? We will conclude the tutorial by outlining future research directions in this area.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "b0e716728e940eb2164892b7e284940157a2cebe",
                    "39d47ba0690cfac4c8efde6ecda104234c70ff86",
                    "be9bb35bc3dc5630ff09895129d4d515aa94ed97",
                    "12cfe5d242c940a0383b55978c7419ee6633ed85",
                    "d45776f8d75b2505e5fd0349275896053f5a4ead",
                    "5678a6e9bd9b4c56f45219e9ccf1a5b6356963d4",
                    "a0035379f93e0e95bdadd77a1d8eb27ba89dcf60",
                    "432da56e21e0d4c85f7ea58159f363732c4ecdd4",
                    "bb583aef8ebaf53db6d01e39143c7998ec2bfb94",
                    "1ce77b594dac02d3d114fe2dba895852216825db",
                    "1b69567bbde7aea5150bf48810b23b2c04512137",
                    "77a94f6c91ee1590dd2c6fd80b4a6d8bffdb91ac",
                    "2aab6ca1a8dae3f3db6d248231ac3fa4e222b30a",
                    "a3a8f179b8589ea51aa553722daf82f87210abc4",
                    "29de7c0fb3c09eaf55b20619bceaeafe72fd87a6",
                    "2d6c0f7774d9d30d4972f5dba1d6e5389b3ddd2f",
                    "f4b33eda909c873c519fce390c3fd66a568c2e27",
                    "6ef6adf8777c50c4f4f0a7cc7804cf9d3317084b",
                    "89ffb2586b23561676e821187aa8fb3bab73bb7f",
                    "63c1abce10c354c64b9d521ee959f9d3dd409169",
                    "f9b16559282e5bea0bb072f9e260a4f0af697f4a",
                    "a16ae67070de155789a871cb27ecbf9eaa98b379"
                ]
            }
        ]
    }
}
