{
    "2023.emnlp-tutorial.4": {
        "title": "LLM-driven Instruction Following: Progresses and Concerns",
        "author": "Wenpeng Yin, Qinyuan Ye, Pengfei Liu, Xiang Ren, Hinrich Schütze",
        "year": 2023,
        "url": "https://aclanthology.org/2023.emnlp-tutorial.4",
        "doi": "10.18653/v1/2023.emnlp-tutorial.4",
        "abstract": "The progress of natural language processing (NLP) is primarily driven by machine learning that optimizes a system on a large-scale set of task-specific labeled examples. This learning paradigm limits the ability of machines to have the same capabilities as humans in handling new tasks since humans can often solve unseen tasks with a couple of examples accompanied by task instructions. In addition, we may not have a chance to prepare task-specific examples of large-volume for new tasks because we cannot foresee what task needs to be addressed next and how complex to annotate for it. Therefore, task instructions act as a novel and promising resource for supervision. This tutorial targets researchers and practitioners who are interested in AI and ML technologies for NLP generalization in a low-shot scenario. In particular, we will present a diverse thread of instruction-driven NLP studies that try to answer the following questions: (i) What is task instruction? (ii) How is the process of creating datasets and evaluating systems conducted? (iii) How to encode task instructions? (iv) When and why do some instructions work better? (v) What concerns remain in LLM-driven instruction following? We will discuss several lines of frontier research that tackle those challenges and will conclude the tutorial by outlining directions for further investigation.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    null,
                    "7b4358d7692353003eae7e39cececa2c2c44c43a",
                    "093d9253a2fe765ca6577b091d3f99bab3155a7d",
                    "6f0650a429add68e9f9430b09e1c6e8780ca787c",
                    "28692beece311a90f5fa1ca2ec9d0c2ce293d069",
                    "605c32428861eb26b8631617b8f6c97a850d6a04",
                    "ecb2b0859bab2761be397804516b8de3983366e8",
                    "f41e6c832c9e0d5360b66ee7681d3b1ffd2d9c3d",
                    "cbdb45fc16b0885905b91d84281c310e6cb49e9c",
                    "a2b150e02306038389f5df683428f5a4659a468e"
                ]
            }
        ]
    }
}
