{
    "2023.emnlp-tutorial.3": {
        "title": "Designing, Evaluating, and Learning from Humans Interacting with NLP Models",
        "author": "Tongshuang Wu, Diyi Yang, Sebastin Santy",
        "year": 2023,
        "url": "https://aclanthology.org/2023.emnlp-tutorial.3",
        "doi": "10.18653/v1/2023.emnlp-tutorial.3",
        "abstract": "The rapid advancement of natural language processing (NLP) research has led to various applications spanning a wide range of domains that require models to interact with humans – e.g., chatbots responding to human inquiries, machine translation systems assisting human translators, designers prompting Large Language Models for co-creation or prototyping AI-infused applications, etc. In these cases, humans interaction is key to the success of NLP applications; any potential misconceptions or differences might lead to error cascades at the subsequent stages. Such interaction involves a lot of design choices around models, e.g. the sensitivity of interfaces, the impact of design choice and evaluation questions, etc. This tutorial aims to provide a systematic and up-to-date overview of key considerations and effective approaches for studying human-NLP model interactions. Our tutorial will focus specifically on the scenario where end users – lay people and domain experts who have access to NLP models but are less familiar with NLP techniques – use or collaborate with deployed models. Throughout the tutorial, we will use five case studies (on classifier-assisted decision making, machine-aided translation, dialog systems, and prompting) to cover three major themes: (1) how to conduct human-in-the-loop usability evaluations to ensure that models are capable of interacting with humans; (2) how to design user interfaces (UIs) and interaction mechanisms that provide end users with easy access to NLP models; (3) how to learn and improve NLP models through the human interactions. We will use best practices from HCI to ground our discussion, and will highlight current challenges and future directions.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "c4788d6d19c9c6555264f274d01fd0c34c22c674",
                    "a16ae67070de155789a871cb27ecbf9eaa98b379",
                    "529025645c70a935221bd434484faee695ad0f25",
                    "ebcbbb8fe297940d79b17aeb6d46bedff9db7fec",
                    "5df85ae89af55c6d82a1a14836ea6bcfbfc2c0ec",
                    "ad3cf68bae32d21f25ac142287d4a556155619d2",
                    "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
                    "053b1d7b97eb2c91fc3921d589c160b0923c70b1"
                ]
            }
        ]
    }
}
