{
    "2022.naacl-tutorials.3": {
        "title": "New Frontiers of Information Extraction",
        "author": "Muhao Chen, Lifu Huang, Manling Li, Ben Zhou, Heng Ji, Dan Roth",
        "year": 2022,
        "url": "https://aclanthology.org/2022.naacl-tutorials.3",
        "doi": "10.18653/v1/2022.naacl-tutorials.3",
        "abstract": "This tutorial targets researchers and practitioners who are interested in AI and ML technologies for structural information extraction (IE) from unstructured textual sources. Particularly, this tutorial will provide audience with a systematic introduction to recent advances of IE, by answering several important research questions. These questions include (i) how to develop an robust IE system from noisy, insufficient training data, while ensuring the reliability of its prediction? (ii) how to foster the generalizability of IE through enhancing the system’s cross-lingual, cross-domain, cross-task and cross-modal transferability? (iii) how to precisely support extracting structural information with extremely fine-grained, diverse and boundless labels? (iv) how to further improve IE by leveraging indirect supervision from other NLP tasks, such as NLI, QA or summarization, and pre-trained language models? (v) how to acquire knowledge to guide the inference of IE systems? We will discuss several lines of frontier research that tackle those challenges, and will conclude the tutorial by outlining directions for further investigation.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "dbfc17833434243e07c4629e58f3d8ed7112dbfe",
                    "a9b04a3e0cf5766df9b3af8c442f2d85ac5e2c7e",
                    "0ba05a24b090435d0edd3865abdd70a9168290b4",
                    "0cdc27a99c1520c2ec604b97470ae75227e096ee",
                    "b9485d1e2c66c3ae452ec4903c2a157caef4d2ed",
                    "e2d38543bd3cf813c63df336b21b003156ed48a8",
                    "ef25f1586cf6630f4a30d41ee5a2848b064dede3",
                    "5a3abc60f0c91a255b1a86843d9e97ab7d63bf08",
                    "ad3b204c495b049fbd25ccf26eb49e78655f8512",
                    "64584150548d79aadad3a0b3e7a3c949967c5d55",
                    "2718cd594d2aa09315da52594877cd71d377dfcf",
                    "04f7834936bf8f455f804c4d84b52fcffc6784ee"
                ]
            }
        ]
    }
}
