{
    "2021.emnlp-tutorials.5": {
        "title": "Robustness and Adversarial Examples in Natural Language Processing",
        "author": "Kai-Wei Chang, He He, Robin Jia, Sameer Singh",
        "year": 2021,
        "url": "https://aclanthology.org/2021.emnlp-tutorials.5",
        "doi": "10.18653/v1/2021.emnlp-tutorials.5",
        "abstract": "Recent studies show that many NLP systems are sensitive and vulnerable to a small perturbation of inputs and do not generalize well across different datasets. This lack of robustness derails the use of NLP systems in real-world applications. This tutorial aims at bringing awareness of practical concerns about NLP robustness. It targets NLP researchers and practitioners who are interested in building reliable NLP systems. In particular, we will review recent studies on analyzing the weakness of NLP systems when facing adversarial inputs and data with a distribution shift. We will provide the audience with a holistic view of 1) how to use adversarial examples to examine the weakness of NLP models and facilitate debugging; 2) how to enhance the robustness of existing NLP models and defense against adversarial inputs; and 3) how the consideration of robustness affects the real-world NLP applications used in our daily lives. We will conclude the tutorial by outlining future research directions in this area.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    5076191,
                    211133221,
                    86813509,
                    218551201,
                    21740766,
                    7228830,
                    202538141,
                    218487582,
                    201657818,
                    220514568,
                    201698258,
                    202541036,
                    219124328,
                    207756753,
                    155100063,
                    166228669,
                    52019251,
                    196202909,
                    54084368,
                    131763622,
                    44220219,
                    220047695,
                    133468229,
                    192546007,
                    218486778,
                    215191351,
                    59604474,
                    52132833,
                    4956100,
                    49413369
                ]
            }
        ]
    }
}