{
    "2021.acl-tutorials.1": {
        "title": "Advances in Debating Technologies: Building AI That Can Debate Humans",
        "author": "Roy Bar-Haim, Liat Ein-Dor, Matan Orbach, Elad Venezian, Noam Slonim",
        "year": 2021,
        "url": "https://aclanthology.org/2021.acl-tutorials.1",
        "doi": "10.18653/v1/2021.acl-tutorials.1",
        "abstract": "The tutorial focuses on Debating Technologies, a sub-field of computational argumentation defined as “computational technologies developed directly to enhance, support, and engage with human debating” (Gurevych et al., 2016). A recent milestone in this field is Project Debater, which was revealed in 2019 as the first AI system that can debate human experts on complex topics. Project Debater is the third in the series of IBM Research AI’s grand challenges, following Deep Blue and Watson. It has been developed for over six years by a large team of researchers and engineers, and its live demonstration in February 2019 received massive media attention. This research effort has resulted in more than 50 scientific papers to date, and many datasets freely available for research purposes. We discuss the scientific challenges that arise when building such a system, including argument mining, argument quality assessment, stance classification, principled argument detection, narrative generation, and rebutting a human opponent. Many of the underlying capabilities of Project Debater have been made freely available for academic research, and the tutorial will include a detailed explanation of how to use and leverage these tools. In addition to discussing individual components, the tutorial also provides a holistic view of a debating system. Such a view is largely missing in the academic literature, where each paper typically addresses a specific problem in isolation. We present a complete pipeline of a debating system, and discuss the information flow and the interaction between the various components. Finally, we discuss practical applications and future challenges of debating technologies.",
        "readingList": [
            {
                "sectionName": "A survey on argument mining",
                "subsectionName": null,
                "referencesIds": [
                    203912051
                ]
            },
            {
                "sectionName": "Project Debater",
                "subsectionName": null,
                "referencesIds": [
                    232305184
                ]
            },
            {
                "sectionName": "Identification of argument components within an article",
                "subsectionName": null,
                "referencesIds": [
                    18847466,
                    1804771,
                    2938060
                ]
            },
            {
                "sectionName": "Corpus-wide argument mining",
                "subsectionName": null,
                "referencesIds": [
                    53083232,
                    208267859
                ]
            },
            {
                "sectionName": "Argument quality",
                "subsectionName": null,
                "referencesIds": [
                    141282,
                    3083231
                ]
            },
            {
                "sectionName": "Stance classification",
                "subsectionName": null,
                "referencesIds": [
                    10432955
                ]
            },
            {
                "sectionName": "Modeling human dilemma",
                "subsectionName": null,
                "referencesIds": [
                    196199072
                ]
            },
            {
                "sectionName": "Listening Comprehension",
                "subsectionName": null,
                "referencesIds": [
                    53080821
                ]
            }
        ]
    }
}