{
    "2021.acl-tutorials.6": {
        "title": "Recognizing Multimodal Entailment",
        "author": "Cesar Ilharco, Afsaneh Shirazi, Arjun Gopalan, Arsha Nagrani, Blaz Bratanic, Chris Bregler, Christina Funk, Felipe Ferreira, Gabriel Barcik, Gabriel Ilharco, Georg Osang, Jannis Bulian, Jared Frank, Lucas Smaira, Qin Cao, Ricardo Marino, Roma Patel, Thomas Leung, Vaiva Imbrasaite",
        "year": 2021,
        "url": "https://aclanthology.org/2021.acl-tutorials.6",
        "doi": "10.18653/v1/2021.acl-tutorials.6",
        "abstract": "How information is created, shared and consumed has changed rapidly in recent decades, in part thanks to new social platforms and technologies on the web. With ever-larger amounts of unstructured and limited labels, organizing and reconciling information from different sources and modalities is a central challenge in machine learning. This cutting-edge tutorial aims to introduce the multimodal entailment task, which can be useful for detecting semantic alignments when a single modality alone does not suffice for a whole content understanding. Starting with a brief overview of natural language processing, computer vision, structured data and neural graph learning, we lay the foundations for the multimodal sections to follow. We then discuss recent multimodal learning literature covering visual, audio and language streams, and explore case studies focusing on tasks which require fine-grained understanding of visual and linguistic semantics question answering, veracity and hatred classification. Finally, we introduce a new dataset for recognizing multimodal entailment, exploring it in a hands-on collaborative section. Overall, this tutorial gives an overview of multimodal learning, introduces a multimodal entailment dataset, and encourages future research in the topic.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "93ed6511a0ae5b13ccf445081ab829d415ca47df",
                    "204e3073870fae3d05bcbc2f6a8e263d9b72e776",
                    "3febb2bed8865945e7fddc99efd791887bb7e14f",
                    "df2b0e26d0599ce3e70df8a9da02e51594e0e992",
                    "7a064df1aeada7e69e5173f7d4c8606f4470365b",
                    "6c4b76232bb72897685d19b3d264c6ee3005bc2b",
                    "a78273144520d57e150744cf75206e881e11cc5b",
                    "65a9c7b0800c86a196bc14e7621ff895cc6ab287",
                    "9915315f5cae822e98c94382ce3b0a6f9a7f8e5e",
                    "79c93274429d6355959f1e4374c2147bb81ea649",
                    "4aa6298b606941a282d735fa3143da293199d2ca",
                    "c41a11c0e9b8b92b4faaf97749841170b760760a",
                    "025a0dc4a2a98742f1b410b6318a46de2c854b22",
                    "10d11f0045dc7f217c7f01bc6cbb47929e9b8808"
                ]
            }
        ]
    }
}

