{
    "2024.eacl-tutorials.1": {
        "title": "Computational modeling of semantic change",
        "author": "Pierluigi Cassotti, Francesco Periti, Stefano De Pascale, Haim Dubossarsky, Nina Tahmasebi",
        "year": 2024,
        "url": "https://aclanthology.org/2024.eacl-tutorials.1",
        "doi": null,
        "abstract": "Languages change constantly over time, influenced by social, technological, cultural and political factors that affect how people express themselves. In particular, words can undergo the process of semantic change, which can be subtle and significantly impact the interpretation of texts. For example, the word terrific used to mean ‘causing terror’ and was as such synonymous to terrifying. Nowadays, speakers use the word in the sense of ‘excessive’ and even ‘amazing’. In Historical Linguistics, tools and methods have been developed to analyse this phenomenon, including systematic categorisations of the types of change, the causes and the mechanisms underlying the different types of change. However, traditional linguistic methods, while informative, are often based on small, carefully curated samples. Thanks to the availability of both large diachronic corpora, the computational means to model word meaning unsupervised, and evaluation benchmarks, we are seeing an increasing interest in the computational modelling of semantic change. This is evidenced by the increasing number of publications in this new domain as well as the organisation of initiatives and events related to this topic, such as four editions of the International Workshop on Computational Approaches to Historical Language Change LChange1, and several evaluation campaigns (Schlechtweg et al., 2020a; Basile et al., 2020b; Kutuzov et al.; Zamora-Reina et al., 2022).",
        "readingList": [
            {
                "sectionName": "Introduction to Semantic Change ",
                "subsectionName": null,
                "referencesIds": [
                    "5a05cd1f253baaa1b67c55d22335403a6251094c",
                    null,
                    null
                ]
            },
            {
                "sectionName": "Surveys",
                "subsectionName": null,
                "referencesIds": [
                    "a41cf8154a64fe95f9c362e5664aebb02b18ee85",
                    "755cda23e5b90d3c3f2aa027cb00dd071ee97386",
                    "ab08495f575c7616b316b86a5e4cdbe84fb5d0e6"
                ]
            },
            {
                "sectionName": "Benchmarks",
                "subsectionName": null,
                "referencesIds": [
                    "a0895e9555527e30b82a8c66b6993683c6cabe14",
                    "16af57bf06ebcba08fb50fd0582df93cab5ada89",
                    "e4ed8bf2155d35ee83a769b9c8f48fb299afc1d8"
                ]
            },
            {
                "sectionName": "Models",
                "subsectionName": null,
                "referencesIds": [
                    "7ee0a337faec1d87bbb15d84856a43a4aa64ac65",
                    "ffa952b637e03bcae13b38e13ce5cf73c6f24e59",
                    "a2fb308508afbe00aab0709f6563719bd86e256a",
                    "6632dfd527f6161feed7fc6ab3970b53ffbbffcc"
                ]
            }
        ]
    }
}

