{
    "2020.emnlp-tutorials.7": {
        "title": "The Amazing World of Neural Language Generation",
        "author": "Yangfeng Ji, Antoine Bosselut, Thomas Wolf, Asli Celikyilmaz",
        "year": 2020,
        "url": "https://aclanthology.org/2020.emnlp-tutorials.7",
        "doi": "10.18653/v1/2020.emnlp-tutorials.7",
        "abstract": "Neural Language Generation (NLG) – using neural network models to generate coherent text – is among the most promising methods for automated text creation. Recent years have seen a paradigm shift in neural text generation, caused by the advances in deep contextual language modeling (e.g., LSTMs, GPT, GPT2) and transfer learning (e.g., ELMo, BERT). While these tools have dramatically improved the state of NLG, particularly for low resources tasks, state-of-the-art NLG models still face many challenges: a lack of diversity in generated text, commonsense violations in depicted situations, difficulties in making use of factual information, and difficulties in designing reliable evaluation metrics. In this tutorial, we will present an overview of the current state-of-the-art in neural network architectures, and how they shaped recent research directions in text generation. We will discuss how and why these models succeed/fail at generating coherent text, and provide insights on several applications.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "d13bb317e87f3f6da10da11059ebf4350b754814",
                    "9405cc0d6169988371b2755e573cc28650d14dfe",
                    "eb011ccdf9ea739ea86be85b268a4d958266b624",
                    "cf4aa38ae31b43fd07abe13b4ffdb265babb7be1",
                    "66021a920001bc3e6258bffe7076d647614147b7",
                    "b7aee9dfb027d6061c6a653684c0fa9a9bba750d",
                    "d82b55c35c8673774a708353838918346f6c006f",
                    "6db2b93a2d4007371030644173f1001c959214d2"
                ]
            }
        ]
    }
}

