{
    "2020.emnlp-tutorials.2": {
        "title": "Fact-Checking, Fake News, Propaganda, and Media Bias: Truth Seeking in the Post-Truth Era",
        "author": "Preslav Nakov, Giovanni Da San Martino",
        "year": 2020,
        "url": "https://aclanthology.org/2020.emnlp-tutorials.2",
        "doi": "10.18653/v1/2020.emnlp-tutorials.2",
        "abstract": "The rise of social media has democratized content creation and has made it easy for everybody to share and spread information online. On the positive side, this has given rise to citizen journalism, thus enabling much faster dissemination of information compared to what was possible with newspapers, radio, and TV. On the negative side, stripping traditional media from their gate-keeping role has left the public unprotected against the spread of misinformation, which could now travel at breaking-news speed over the same democratic channel. This has given rise to the proliferation of false information specifically created to affect individual people’s beliefs, and ultimately to influence major events such as political elections. There are strong indications that false information was weaponized at an unprecedented scale during Brexit and the 2016 U.S. presidential elections. “Fake news,” which can be defined as fabricated information that mimics news media content in form but not in organizational process or intent, became the Word of the Year for 2017, according to Collins Dictionary. Thus, limiting the spread of “fake news” and its impact has become a major focus for computer scientists, journalists, social media companies, and regulatory authorities. The tutorial will offer an overview of the broad and emerging research area of disinformation, with focus on the latest developments and research directions.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "cb40a5e6d4fc0290452345791bb91040aed76961",
                    "290513795d653bd13a27c0688b12a459eb66c711",
                    "22616702da06431668022c649a017af9b333c530",
                    "6447bfcda1dfb2fa8484683711af92b7cbaeca2b",
                    "73bfad11b96a69cb882028ead115751adb55252d",
                    "ef07defaf08123d5e1a8bd41ad6e2db5e5b225e3",
                    "8114cf0628c29e8309d6f1e2ef61030f64a7b28c",
                    "d3833e446e536f7627ae01c45cf265d6e736e78c",
                    "6f90ad2553c2a73948f614d19c763ec3d5e58542",
                    "8ce2cb70d5a98ebe3bc6cb10d830dd2282a3e766",
                    "2ed166a3301209ccd9838e26ec4648a4d2f07bd9"
                ]
            }
        ]
    }
}

