{
    "2024.lrec-tutorials.1": {
        "title": "From Multimodal LLM to Human-level AI: Modality, Instruction, Reasoning, Efficiency and beyond",
        "author": "Hao Fei, Yuan Yao, Zhuosheng Zhang, Fuxiao Liu, Ao Zhang, Tat-Seng Chua",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.1",
        "doi": null,
        "abstract": "Artificial intelligence (AI) encompasses knowledge acquisition and real-world grounding across various modalities. As a multidisciplinary research field, multimodal large language models (MLLMs) have recently garnered growing interest in both academia and industry, showing an unprecedented trend to achieve human-level AI via MLLMs. These large models offer an effective vehicle for understanding, reasoning, and planning by integrating and modeling diverse information modalities, including language, visual, auditory, and sensory data. This tutorial aims to deliver a comprehensive review of cutting-edge research in MLLMs, focusing on four key areas: MLLM architecture design, instructional learning, multimodal reasoning, and the efficiency of MLLMs. We will explore technical advancements, synthesize key challenges, and discuss potential avenues for future research.",
        "readingList": [
            {
                "sectionName": "LLMs and MLLMs",
                "subsectionName": null,
                "referencesIds": [
                    218971783,
                    257532815,
                    248476411,
                    256390509,
                    258179774,
                    257404891,
                    257833781,
                    258822817,
                    258564264,
                    261696650,
                    263137930,
                    261076491,
                    263333963,
                    261101015,
                    259262263
                ]
            },
            {
                "sectionName": "Instruction Tuning",
                "subsectionName": null,
                "referencesIds": [
                    258291930,
                    258179774,
                    259251834,
                    258418343,
                    259501644,
                    258352455
                ]
            },
            {
                "sectionName": "Reasoning with LLM",
                "subsectionName": null,
                "referencesIds": [
                    256504063,
                    261823391,
                    258212542,
                    262053313
                ]
            },
            {
                "sectionName": "Efficient Learning",
                "subsectionName": null,
                "referencesIds": [
                    235458009,
                    258841328,
                    258179774,
                    258865326,
                    258436945
                ]
            }
        ]
    }
}