{
    "2024.lrec-tutorials.9": {
        "title": "Formal Semantic Controls over Language Models",
        "author": "Danilo Silva de Carvalho, Yingji Zhang, André Freitas",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.9",
        "doi": null,
        "abstract": "Text embeddings provide a concise representation of the semantics of sentences and larger spans of text, rather than individual words, capturing a wide range of linguistic features. They have found increasing application to a variety of NLP tasks, including machine translation and natural language inference. While most recent breakthroughs in task performance are being achieved by large scale distributional models, there is a growing disconnection between their knowledge representation and traditional semantics, which hinders efforts to capture such knowledge in human interpretable form or explain model inference behaviour. In this tutorial, we examine from basics to the cutting edge research on the analysis and control of text representations, aiming to shorten the gap between deep latent semantics and formal symbolics. This includes the considerations on knowledge formalisation, the linguistic information that can be extracted and measured from distributional models, and intervention techniques that enable explainable reasoning and controllable text generation, covering methods from pooling to LLM-based.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "184ac0766262312ba76bbdece4e7ffad0aa8180b",
                    null,
                    "530a059cb48477ad1e3d4f8f4b153274c8997332",
                    "02a715a0bee9065a259f78876d8f4f92090cad01",
                    "c41516420ddbd0f29e010ca259a74c1fc2da0466",
                    "f4c671ba8608d187e3cdba21232489e18fac67e6",
                    "c331a3e3e55d95beb8be5cec9ccc772e72b32282",
                    "2886734184eb7efc1dca1b33c35d33bc41cdfe5c",
                    "b7395263bbb1612ab6fdf9ca331792a6542d713a"
                ]
            }
        ]
    }
}