{
    "2024.lrec-tutorials.2": {
        "title": "Geo-Cultural Representation and Inclusion in Language Technologies",
        "author": "Sunipa Dev, Rida Qadri",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.2",
        "doi": null,
        "abstract": "Training and evaluation of language models are increasingly relying on semi-structured data that is annotated by humans, along with techniques such as RLHF growing in usage across the board. As a result, both the data and the human perspectives involved in this process play a key role in what is taken as ground truth by our models. As annotation tasks are becoming increasingly more subjective and culturally complex, it is unclear how much of their socio-cultural identity annotators use to respond to tasks. We also currently do not have ways to integrate rich and diverse community perspectives into our language technologies. Accounting for such cross-cultural differences in interacting with technology is an increasingly crucial step for evaluating AI harms holistically. Without this, the state of the art of the AI models being deployed is at risk of causing unprecedented biases at a global scale. In this tutorial, we will take an interactive approach by utilizing some different types of annotation tasks to investigate together how our different socio-cultural perspectives and lived experiences influence what we consider as appropriate representations of global concepts.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "6159a9048cf3efb9bcee231b175932d07be33e37",
                    "f4f154892800008894ebbf57add31fcaac4f27ca",
                    "8a3d1ce6dd9dc9766a42e645a23de4b5f2b447ec",
                    "6615e9d1641e5b8141efa8e947a90d12b3158075",
                    "ca94c924d8a3b77a2bd5b16ffc03b8723bce9c1f"
                ]
            }
        ]
    }
}