{
    "2024.lrec-tutorials.5": {
        "title": "Mining, Assessing, and Improving Arguments in NLP and the Social Sciences",
        "author": "Gabriella Lapesa, Eva Maria Vecchi, Serena Villata, Henning Wachsmuth",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.5",
        "doi": null,
        "abstract": "Computational argumentation is an interdisciplinary research field, connecting Natural Language Processing (NLP) to other disciplines such as the social sciences. The focus of recent research has concentrated on argument quality assessment: what makes an argument good or bad? We present a tutorial which is an updated edition of the EACL 2023 tutorial presented by the same authors. As in the previous version, the tutorial will have a strong interdisciplinary and interactive nature, and will be structured along three main coordinates: (1) the notions of argument quality (AQ) across disciplines (how do we recognize good and bad arguments?), with a particular focus on the interface between Argument Mining (AM) and Deliberation Theory; (2) the modeling of subjectivity (who argues to whom; what are their beliefs?); and (3) the generation of improved arguments (what makes an argument better?). The tutorial will also touch upon a series of topics that are particularly relevant for the LREC-COLING audience (the issue of resource quality for the assessment of AQ; the interdisciplinary application of AM and AQ in a text-as-data approach to Political Science), in line with the developments in NLP (LLMs for AQ assessment), and relevant for the societal applications of AQ assessment (bias and debiasing). We will involve the participants in two annotation studies on the assessment and the improvement of quality.",
        "readingList": [
            {
                "sectionName": "Survey Papers",
                "subsectionName": null,
                "referencesIds": [
                    51609977,
                    203912051,
                    236460206,
                    235694638,
                    259195540
                ]
            },
            {
                "sectionName": "Mining Arguments",
                "subsectionName": null,
                "referencesIds": [
                    5252401,
                    11014757,
                    31107411,
                    227230554
                ]
            },
            {
                "sectionName": "Assessing Argument Quality",
                "subsectionName": null,
                "referencesIds": [
                    141282,
                    219177237,
                    256631011,
                    258865955
                ]
            },
            {
                "sectionName": "Assessing Deliberative Quality",
                "subsectionName": null,
                "referencesIds": [
                    56161114,
                    157370225
                ]
            },
            {
                "sectionName": "Improving Arguments",
                "subsectionName": null,
                "referencesIds": [
                    44099358,
                    239885913,
                    260813729,
                    258947072,
                    254854351
                ]
            },
            {
                "sectionName": "Challenges",
                "subsectionName": null,
                "referencesIds": [
                    202768765,
                    222310410,
                    227151662
                ]
            }
        ]
    }
}