{
    "2024.lrec-tutorials.13": {
        "title": "Knowledge-enhanced Response Generation in Dialogue Systems: Current Advancements and Emerging Horizons",
        "author": "Priyanshu Priya, Deeksha Varshney, Mauajama Firdaus, Asif Ekbal",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.13",
        "doi": null,
        "abstract": "This tutorial provides an in-depth exploration of Knowledge-enhanced Dialogue Systems (KEDS), diving into their foundational aspects, methodologies, advantages, and practical applications. Topics include the distinction between internal and external knowledge integration, diverse methodologies employed in grounding dialogues, and innovative approaches to leveraging knowledge graphs for enhanced conversation quality. Furthermore, the tutorial touches upon the rise of biomedical text mining, the advent of domain-specific language models, and the challenges and strategies specific to medical dialogue generation. The primary objective is to give attendees a comprehensive understanding of KEDS. By delineating the nuances of these systems, the tutorial aims to elucidate their significance, highlight advancements made using deep learning, and pinpoint the current challenges. Special emphasis is placed on showcasing how KEDS can be fine-tuned for domain-specific requirements, with a spotlight on the healthcare sector. The tutorial is crafted for both beginners and intermediate researchers in the dialogue systems domain, with a focus on those keen on advancing research in KEDS. It will also be valuable for practitioners in sectors like healthcare, seeking to integrate advanced dialogue systems.",
        "readingList": [
            {
                "sectionName": "Survey",
                "subsectionName": null,
                "referencesIds": [
                    "a6401e102c03a441992b3e45f7b63eec09d4b89d",
                    "77b101d2c0f3d2842edb4acdbca0c4e859cda4d5",
                    "c845494445f3bfa01d8245a4759b144e27aa3788",
                    "35763b04ca7ec8d1cbdacb3be5635015d2f7ad9b"
                ]
            },
            {
                "sectionName": "Knowledge-enhanced Response Generation",
                "subsectionName": null,
                "referencesIds": [
                    "04aa1605c650bee77e09ad61c4e894ecb9f543a8",
                    "3d6b094f439ceae770ad1ca5cb322421debf3ba8",
                    "0ed502bc03b3fb6d7c4356d0daf34bd915daeb91",
                    "980456f50cd4b6e30649592afb693d5b6af8a703"
                ]
            },
            {
                "sectionName": "Basic papers",
                "subsectionName": null,
                "referencesIds": [
                    "204e3073870fae3d05bcbc2f6a8e263d9b72e776",
                    "cea967b59209c6be22829699f05b8b1ac4dc092d",
                    "fa72afa9b2cbc8f0d7b05d52548906610ffbb9c5",
                    "02534853626c18c9a097c2712f1ddf3613257d35",
                    "668db48c6a79826456341680ee1175dfc4cced71"
                ]
            }
        ]
    }
}