{
    "2024.lrec-tutorials.10": {
        "title": "Towards a Human-Computer Collaborative Scientific Paper Lifecycle: A Pilot Study and Hands-On Tutorial",
        "author": "Qingyun Wang, Carl Edwards, Heng Ji, Tom Hope",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.10",
        "doi": null,
        "abstract": "Due to the rapid growth of publications varying in quality, there exists a pressing need to help scientists digest and evaluate relevant papers, thereby facilitating scientific discovery. This creates a number of urgent questions; however, computer-human collaboration in the scientific paper lifecycle is still in the exploratory stage and lacks a unified framework for analyzing the relevant tasks. Additionally, with the recent significant success of large language models (LLMs), they have increasingly played an important role in academic writing. In this cutting-edge tutorial, we aim to provide an all-encompassing overview of the paper lifecycle, detailing how machines can augment every stage of the research process for the scientist, including scientific literature understanding, experiment development, manuscript draft writing, and finally draft evaluation. This tutorial is devised for researchers interested in this rapidly-developing field of NLP-augmented paper writing. The tutorial will also feature a session of hands-on exercises during which participants can guide machines in generating ideas and automatically composing key paper elements. Furthermore, we will address current challenges, explore future directions, and discuss potential ethical issues. A toolkit designed for human-computer collaboration throughout the paper lifecycle will also be made publically available.",
        "readingList": [
            {
                "sectionName": "Related Tutorials",
                "subsectionName": null,
                "referencesIds": [
                    221191589,
                    250390715,
                    263866951
                ]
            },
            {
                "sectionName": "General Guideline",
                "subsectionName": null,
                "referencesIds": [
                    236456742,
                    231740610,
                    258361324,
                    257463753
                ]
            },
            {
                "sectionName": "Survey Papers",
                "subsectionName": null,
                "referencesIds": [
                    245769589,
                    258947504,
                    248512482
                ]
            },
            {
                "sectionName": "Scientific IE",
                "subsectionName": null,
                "referencesIds": [
                    52118895,
                    218470122,
                    245704273,
                    258685532
                ]
            },
            {
                "sectionName": "Scientific IR",
                "subsectionName": null,
                "referencesIds": [
                    220056972
                ]
            },
            {
                "sectionName": "Review Generation",
                "subsectionName": null,
                "referencesIds": [
                    250286985
                ]
            },
            {
                "sectionName": "Hypothesis Generation",
                "subsectionName": null,
                "referencesIds": [
                    252682946
                ]
            },
            {
                "sectionName": "Paper Draft Generation",
                "subsectionName": null,
                "referencesIds": [
                    232126179
                ]
            }
        ]
    }
}