{
    "2024.lrec-tutorials.4": {
        "title": "Navigating the Modern Evaluation Landscape: Considerations in Benchmarks and Frameworks for Large Language Models (LLMs)",
        "author": "Leshem Choshen, Ariel Gera, Yotam Perlitz, Michal Shmueli-Scheuer, Gabriel Stanovsky",
        "year": 2024,
        "url": "https://aclanthology.org/2024.lrec-tutorials.4",
        "doi": null,
        "abstract": "General-Purpose Language Models have changed the world of Natural Language Processing, if not the world itself. The evaluation of such versatile models, while supposedly similar to evaluation of generation models before them, in fact presents a host of new evaluation challenges and opportunities. In this Tutorial, we will start from the building blocks of evaluation. The tutorial welcomes people from diverse backgrounds and assumes little familiarity with metrics, datasets, prompts and benchmarks. It will lay the foundations and explain the basics and their importance, while touching on the major points and breakthroughs of the recent era of evaluation. It will also compare traditional evaluation methods – which are still widely used – to newly developed methods. We will contrast new to old approaches, from evaluating on many-task benchmarks rather than on dedicated datasets to efficiency constraints, and from testing stability and prompts on in-context learning to using the models themselves as evaluation metrics. Finally, the tutorial will cover practical issues, ranging from reviewing widely-used benchmarks and prompt banks to efficient evaluation.",
        "readingList": [
            {
                "sectionName": "Surveys on evaluation of LLMs",
                "subsectionName": null,
                "referencesIds": [
                    5000956,
                    260899983,
                    246822399
                ]
            },
            {
                "sectionName": "Pre-training paradigms",
                "subsectionName": null,
                "referencesIds": [
                    240420063
                ]
            },
            {
                "sectionName": "Current benchmarks",
                "subsectionName": null,
                "referencesIds": [
                    253553585,
                    263625818,
                    null
                ]
            },
            {
                "sectionName": "Prompts",
                "subsectionName": "creating paraphrases",
                "referencesIds": [
                    233296808,
                    254408772,
                    254853659
                ]
            },
            {
                "sectionName": "Prompts",
                "subsectionName": "robustness to paraphrases",
                "referencesIds": [
                    254366640,
                    259203613,
                    266693922
                ]
            },
            {
                "sectionName": "Metrics",
                "subsectionName": null,
                "referencesIds": [
                    221340941,
                    259129398
                ]
            },
            {
                "sectionName": "Efficient-benchmarking",
                "subsectionName": null,
                "referencesIds": [
                    261076362,
                    262045288,
                    253553585
                ]
            },
            {
                "sectionName": "Manual Evaluation",
                "subsectionName": null,
                "referencesIds": [
                    263608566,
                    259859021
                ]
            }
        ]
    }
}