{
    "2021.naacl-tutorials.3": {
        "title": "Deep Learning on Graphs for Natural Language Processing",
        "author": "Lingfei Wu, Yu Chen, Heng Ji, Yunyao Li",
        "year": 2021,
        "url": "https://aclanthology.org/2021.naacl-tutorials.3",
        "doi": "10.18653/v1/2021.naacl-tutorials.3",
        "abstract": "Due to its great power in modeling non-Euclidean data like graphs or manifolds, deep learning on graph techniques (i.e., Graph Neural Networks (GNNs)) have opened a new door to solving challenging graph-related NLP problems. There has seen a surge of interests in applying deep learning on graph techniques to NLP, and has achieved considerable success in many NLP tasks, ranging from classification tasks like sentence classification, semantic role labeling and relation extraction, to generation tasks like machine translation, question generation and summarization. Despite these successes, deep learning on graphs for NLP still face many challenges, including automatically transforming original text sequence data into highly graph-structured data, and effectively modeling complex data that involves mapping between graph-based inputs and other highly structured output data such as sequences, trees, and graph data with multi-types in both nodes and edges. This tutorial will cover relevant and interesting topics on applying deep learning on graph techniques to NLP, including automatic graph construction for NLP, graph representation learning for NLP, advanced GNN based models (e.g., graph2seq, graph2tree, and graph2graph) for NLP, and the applications of GNNs in various NLP tasks (e.g., machine translation, natural language generation, information extraction and semantic parsing). In addition, hands-on demonstration sessions will be included to help the audience gain practical experience on applying GNNs to solve challenging NLP problems using our recently developed open source library – Graph4NLP, the first library for researchers and practitioners for easy use of GNNs for various NLP tasks.",
        "readingList": [
            {
                "sectionName": "GNNs",
                "subsectionName": null,
                "referencesIds": [
                    "36eff562f65125511b5dfab68ce7f7a943c27478",
                    "492f57ee9ceb61fb5a47ad7aebfec1121887a175",
                    "6b7d6e6416343b2a122f8416e69059ce919026ef"
                ]
            },
            {
                "sectionName": "automatic graph construction for NLP",
                "subsectionName": null,
                "referencesIds": [
                    "2784000e1a3554374662f4d18cb5ad52f59c8de6",
                    "e47e6c814d2742527fdd352db13a5fd95b7ce24b",
                    "ff6a4a9a41b78c8b1fcab185db780266bbb06caf"
                ]
            },
            {
                "sectionName": "joint text and knowledge representation learning",
                "subsectionName": null,
                "referencesIds": [
                    "9e979667aa81c294062c02ab3a48e87e47c54987",
                    "222dcbf5ee19fdfc9cfbd9c75af168a5c2122a4a"
                ]
            },
            {
                "sectionName": "modeling directed graphs",
                "subsectionName": null,
                "referencesIds": [
                    "94eb48c1878efbe2ccff121bd600dd0fd8a75650",
                    "e47e6c814d2742527fdd352db13a5fd95b7ce24b"
                ]
            },
            {
                "sectionName": "and heterogeneous graphs",
                "subsectionName": null,
                "referencesIds": [
                    "2784000e1a3554374662f4d18cb5ad52f59c8de6",
                    "d365f9c805d59788f9ae5ad36fee69f9abd8d3c7"
                ]
            },
            {
                "sectionName": "GNN based encoder-decoder models",
                "subsectionName": null,
                "referencesIds": [
                    "94eb48c1878efbe2ccff121bd600dd0fd8a75650",
                    "e47e6c814d2742527fdd352db13a5fd95b7ce24b",
                    "f1aef5403012d2a70344bc70d58d720aef85834c"
                ]
            }
        ]
    }
}

