{
    "2021.naacl-tutorials.2": {
        "title": "Fine-grained Interpretation and Causation Analysis in Deep NLP Models",
        "author": "Hassan Sajjad, Narine Kokhlikyan, Fahim Dalvi, Nadir Durrani",
        "year": 2021,
        "url": "https://aclanthology.org/2021.naacl-tutorials.2",
        "doi": "10.18653/v1/2021.naacl-tutorials.2",
        "abstract": "Deep neural networks have constantly pushed the state-of-the-art performance in natural language processing and are considered as the de-facto modeling approach in solving complex NLP tasks such as machine translation, summarization and question-answering. Despite the proven efficacy of deep neural networks at-large, their opaqueness is a major cause of concern. In this tutorial, we will present research work on interpreting fine-grained components of a neural network model from two perspectives, i) fine-grained interpretation, and ii) causation analysis. The former is a class of methods to analyze neurons with respect to a desired language concept or a task. The latter studies the role of neurons and input features in explaining the decisions made by the model. We will also discuss how interpretation methods and causation analysis can connect towards better interpretability of model prediction. Finally, we will walk you through various toolkits that facilitate fine-grained interpretation and causation analysis of neural models.",
        "readingList": [
            {
                "sectionName": "survey papers",
                "subsectionName": null,
                "referencesIds": [
                    "668f42a4d4094f0a66d402a16087e14269b31a1f",
                    "4b322cf280f459deb6d9e2eb2430d1a28141934c"
                ]
            },
            {
                "sectionName": "Fine-grained analysis and its Applications",
                "subsectionName": null,
                "referencesIds": [
                    "c5489d244bfc1e9b0d8c94bf6dd774ee1aca2def",
                    "9c2156bc35c6f8e68aa21d4b2f339134a4d28708",
                    "56d1003fd02346e93354ab55cd204485c268512a",
                    "bf30db07357427cda6cc2b64fbcea783eb048f05"
                ]
            },
            {
                "sectionName": "Causation analysis",
                "subsectionName": null,
                "referencesIds": [
                    "442e10a3c6640ded9408622005e3c2a8906ce4c2",
                    "cf592385909a1e3e9a428d8d6d8f427ab70b60a9",
                    "f302e136c41db5de1d624412f68c9174cf7ae8be",
                    "eb322f6f798fd1b381896d0b79f5498d89585b1f",
                    "c0883f5930a232a9c1ad601c978caede29155979",
                    "798ea191aad9401462b405fde1a6cefb4fe53fd5"
                ]
            }
        ]
    }
}

