{
    "2023.acl-tutorials.1": {
        "title": "Goal Awareness for Conversational AI: Proactivity, Non-collaborativity, and Beyond",
        "author": "Yang Deng, Wenqiang Lei, Minlie Huang, Tat-Seng Chua",
        "year": 2023,
        "url": "https://aclanthology.org/2023.acl-tutorials.1",
        "doi": "10.18653/v1/2023.acl-tutorials.1",
        "abstract": "Conversational systems are envisioned to provide social support or functional service to human users via natural language interactions. Conventional conversation researches mainly focus on the responseability of the system, such as dialogue context understanding and response generation, but overlooks the design of an essential property in intelligent conversations, i.e., goal awareness. The awareness of goals means the state of not only being responsive to the users but also aware of the target conversational goal and capable of leading the conversation towards the goal, which is a significant step towards higher-level intelligence and artificial consciousness. It can not only largely improve user engagement and service efficiency in the conversation, but also empower the system to handle more complicated conversation tasks that involve strategical and motivational interactions. In this tutorial, we will introduce the recent advances on the design of agent’s awareness of goals in a wide range of conversational systems.",
        "readingList": [
            {
                "sectionName": "Previous Tutorials",
                "subsectionName": null,
                "referencesIds": [
                    "a5a8dfe5dcfa998124c8f115f5f743da2c40d714",
                    "8cf9c6bccccde9283f4089f7fe99fb1fa2c2df9a",
                    "83e567c2822aeda91006096a5d7ac0b34721d2a5",
                    "2165904b8041784ac545e7934d235664b6e77a08",
                    "8bc6162766b4e6cd616ad508ea488ecc628cf4ac"
                ]
            },
            {
                "sectionName": "Related Surveys or Book Chapters",
                "subsectionName": null,
                "referencesIds": [
                    "a6401e102c03a441992b3e45f7b63eec09d4b89d",
                    "83e567c2822aeda91006096a5d7ac0b34721d2a5",
                    "89e65078d37d076627818d9dba2c8ca9bf8f66bc",
                    "4ad0dc7a0a6a0142d308439b6c7375d27d81db36",
                    "b97a33933541c276778c3fe63baad6964f4bdf44",
                    "a7c86246a3cfdfb5219a0fec1426ecd9072c66ab"
                ]
            }
        ]
    }
}