{
    "2023.eacl-tutorials.3": {
        "title": "Summarization of Dialogues and Conversations At Scale",
        "author": "Diyi Yang, Chenguang Zhu",
        "year": 2023,
        "url": "https://aclanthology.org/2023.eacl-tutorials.3",
        "doi": "10.18653/v1/2023.eacl-tutorials.3",
        "abstract": "Conversations are the natural communication format for people. This fact has motivated the large body of question answering and chatbot research as a seamless way for people to interact with machines. The conversations between people however, captured as video, audio or private or public written conversations, largely remain untapped as a source of compelling starting point for developing language technology. Summarizing such conversations can be enormously beneficial: automatic minutes for meetings or meeting highlights sent to relevant people can optimize communication in various groups while minimizing demands on people’s time; similarly analysis of conversations in online support groups can provide valuable information to doctors about the patient concerns. Summarizing written and spoken conversation poses unique research challenges—text reformulation, discourse and meaning analysis beyond the sentence, collecting data, and proper evaluation metrics. All these have been revisited by researchers since the emergence of neural approaches as the dominant approach for solving language processing problems. In this tutorial, we will survey the cutting-edge methods for summarization of conversations, covering key sub-areas whose combination is needed for a successful solution.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "f9700e31a1d0ae34d4571ab056dfb268c1543349",
                    "86cb79083bfa5dc6329ab1b8c7099af76fefde36",
                    "ac95a18762133d4065ac8af518c33084d83c5582",
                    "0ac7c7279f52e8cc98171254534276d9644cf92c",
                    "b519511993b63423be6e3580cf3ce63ea77e9e2f",
                    "aa28873534c24e4a8c5deb7bff723cd5fc69a6f0",
                    "fa51076458b7bcf9a60f476d525755e47199a6d8"
                ]
            }
        ]
    }
}
