{
    "2023.eacl-tutorials.1": {
        "title": "Mining, Assessing, and Improving Arguments in NLP and the Social Sciences",
        "author": "Gabriella Lapesa, Eva Maria Vecchi, Serena Villata, Henning Wachsmuth",
        "year": 2023,
        "url": "https://aclanthology.org/2023.eacl-tutorials.1",
        "doi": "10.18653/v1/2023.eacl-tutorials.1",
        "abstract": "Computational argumentation is an interdisciplinary research field, connecting Natural Language Processing (NLP) to other disciplines such as the social sciences. This tutorial will focus on a task that recently got into the center of attention in the community: argument quality assessment, that is, what makes an argument good or bad? We structure the tutorial along three main coordinates: (1) the notions of argument quality across disciplines (how do we recognize good and bad arguments?), (2) the modeling of subjectivity (who argues to whom; what are their beliefs?), and (3) the generation of improved arguments (what makes an argument better?). The tutorial highlights interdisciplinary aspects of the field, ranging from the collaboration of theory and practice (e.g., in NLP and social sciences), to approaching different types of linguistic structures (e.g., social media versus parliamentary texts), and facing the ethical issues involved (e.g., how to build applications for the social good). A key feature of this tutorial is its interactive nature: We will involve the participants in two annotation studies on the assessment and the improvement of quality, and we will encourage them to reflect on the challenges and potential of these tasks.",
        "readingList": [
            {
                "sectionName": "Survey Papers",
                "subsectionName": null,
                "referencesIds": [
                    51609977,
                    203912051,
                    236460206
                ]
            },
            {
                "sectionName": "Mining Arguments ",
                "subsectionName": null,
                "referencesIds": [
                    5252401,
                    11014757,
                    31107411
                ]
            },
            {
                "sectionName": "Assessing Argument Quality",
                "subsectionName": null,
                "referencesIds": [
                    141282,
                    219177237,
                    256631011
                ]
            },
            {
                "sectionName": "Assessing Deliberative Quality",
                "subsectionName": null,
                "referencesIds": [
                    56161114,
                    157370225
                ]
            },
            {
                "sectionName": "Improving Arguments",
                "subsectionName": null,
                "referencesIds": [
                    44099358,
                    219065800,
                    239885913
                ]
            },
            {
                "sectionName": "Challenges",
                "subsectionName": null,
                "referencesIds": [
                    202768765,
                    222310410,
                    227151662
                ]
            }
        ]
    }
}