{
    "2020.acl-tutorials.2": {
        "title": "Integrating Ethics into the NLP Curriculum",
        "author": "Bender, Emily M. and Hovy, Dirk and Schofield, Alexandra",
        "year": 2020,
        "url": "https://aclanthology.org/2020.acl-tutorials.2",
        "doi": "10.18653/v1/2020.acl-tutorials.2",
        "abstract": "To raise awareness among future NLP practitioners and prevent inertia in the field, we need to place ethics in the curriculum for all NLP students—not as an elective, but as a core part of their education. Our goal in this tutorial is to empower NLP researchers and practitioners with tools and resources to teach others about how to ethically apply NLP techniques. We will present both high-level strategies for developing an ethics-oriented curriculum, based on experience and best practices, as well as specific sample exercises that can be brought to a classroom. This highly interactive work session will culminate in a shared online resource page that pools lesson plans, assignments, exercise ideas, reading suggestions, and ideas from the attendees. Though the tutorial will focus particularly on examples for university classrooms, we believe these ideas can extend to company-internal workshops or tutorials in a variety of organizations. In this setting, a key lesson is that there is no single approach to ethical NLP: each project requires thoughtful consideration about what steps can be taken to best support people affected by that project. However, we can learn (and teach) what issues to be aware of, what questions to ask, and what strategies are available to mitigate harm.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "0e661bd2cfe94ed58e4e2abc1409c75b98c2582c",
                    null,
                    "e8fa186444d98a39ee9139b1f5dd0c7618caef8f",
                    "f9acf607b858ac110c1bf83bf62835bcc1820e83",
                    "c9fa1cb56feeeb5033aa7ba40fa035ca2b9018ce",
                    "0fee3b6c72f7676b4934651e517d0a328048c600"
                ]
            }
        ]
    }
}

