{
    "2020.acl-tutorials.1": {
        "title": "Interpretability and Analysis in Neural NLP",
        "author": "Belinkov, Yonatan and Gehrmann, Sebastian and Pavlick, Ellie",
        "year": 2020,
        "url": "https://aclanthology.org/2020.acl-tutorials.1",
        "doi": "10.18653/v1/2020.acl-tutorials.1",
        "abstract": "While deep learning has transformed the natural language processing (NLP) field and impacted the larger computational linguistics community, the rise of neural networks is stained by their opaque nature: It is challenging to interpret the inner workings of neural network models, and explicate their behavior. Therefore, in the last few years, an increasingly large body of work has been devoted to the analysis and interpretation of neural network models in NLP. This body of work is so far lacking a common framework and methodology. Moreover, approaching the analysis of modern neural networks can be difficult for newcomers to the field. This tutorial aims to fill this gap and introduce the nascent field of interpretability and analysis of neural networks in NLP. The tutorial will cover the main lines of analysis work, such as structural analyses using probing classifiers, behavioral studies and test suites, and interactive visualizations. We will highlight not only the most commonly applied analysis methods, but also the specific limitations and shortcomings of current approaches, in order to inform participants where to focus future efforts.",
        "readingList": [
            {
                "sectionName": null,
                "subsectionName": null,
                "referencesIds": [
                    "668f42a4d4094f0a66d402a16087e14269b31a1f",
                    "f170fed9acd71bd5feb20901c7ec1fe395f3fae5",
                    "e2587eddd57bc4ba286d91b27c185083f16f40ee",
                    "3aa52436575cf6768a0a1a476601825f6a62e58f",
                    "843c6b0a35b02e2c3d74bb545e74bc655e16e992",
                    "fa72afa9b2cbc8f0d7b05d52548906610ffbb9c5",
                    "4c41104e871bccbd56494350a71d77a7f1da5bb0",
                    "63c4114bd373dd0fcfe0d25a605b353c62be2995",
                    "78aa018ee7d52360e15d103390ea1cdb3a0beb41",
                    "514e7fb769950dbe96eb519c88ca17e04dc829f6"
                ]
            }
        ]
    }
}

